wikimedia/smash-pig/PaymentProviders/dlocal/Tests/Data/Wikimedia_Settlement_Reports_20260110.csv

ROW_TYPE,SETTLEMENT_CURRENCY,NUMBER_OF_ITEMS,GROSS_TOTAL_AMOUNT,FEE_TOTAL_AMOUNT,NET_TOTAL_AMOUNT,TRANSFER_DATE,TRANSFER_ID,,,,,,,,,,,,,,,,,
HEADER,USD,1356,259.7,-80.22,179.49,2026-01-09,642926,,,,,,,,,,,,,,,,,
ROW_TYPE,MID,LOGIN,COUNTRY,CREATION_DATE,APPROVED_DATE,TRANSACTION_ID,DLOCAL_TRANSACTION_ID,LOCAL_AMOUNT,LOCAL_CURRENCY,FX_RATE,GROSS_AMOUNT,FEE_AMOUNT,NET_AMOUNT,PAYMENT_TYPE,PAYMENT_METHOD_CODE,CARD_BIN,CARD_TYPE,INSTALLMENTS,STATUS,STATUS_CODE,STATUS_DETAILS,USER_DOCUMENT,USER_EMAIL,DESCRIPTION
ADJUSTMENT,648,YW1EV5zd8c,,2026-01-02 18:45:12,2026-01-02 18:45:12,,805113614,0,,0,-2.38,0,-2.38,DEBIT NOTE,,,,,,,,,,Retries Fees penalties by Processor for CL/USD
CAPTURE,648,YW1EV5zd8c,Brazil,2025-12-20 00:35:09,2025-12-20 00:35:10,1bV83QePtLcLAxiIgM4et2,T-648-x1438o,170,BRL,6.460365,254.0104,-0.057909,253.952491,CARD,VI,453211,CREDIT,1,PAID,200,The payment was paid.,37970511821,a@example.org,
PAYMENT,648,YW1EV5zd8c,Brazil,2025-12-21 17:49:16,2025-12-21 17:51:08,4Hjmb44X6L4qLYy3DJmJnc,R-648-x1g7o,22,BRL,6.458397,3.287193,-0.068128,3.219065,TICKET,PQ,,,0,PAID,200,The payment was paid.,63546850963,b@example.org,243147604.1
PAYMENT,648,YW1EV5zd8c,Brazil,2025-12-22 04:47:19,2025-12-22 04:47:21,204509068.22,T-648-x1kocac,6.75,BRL,6.454676,1.008571,-0.022993,0.985578,CARD,MC,516292,CREDIT,1,PAID,200,The payment was paid.,3882974923,c@example.org,Wikimedia Foundation (Recurring)
PAYMENT,648,YW1EV5zd8c,Mexico,2025-12-22 04:52:13,2025-12-22 04:52:14,204515653.22,T-648-x17i8,70,MXN,18.557198,3.772121,-0.075442,3.696679,CARD,MD,525678,DEBIT,1,PAID,200,The payment was paid.,2574384297854,d@example.org,Wikimedia Foundation (Recurring)
SETTLEMENT_FEE,648,,,,,,642926,0,,0,0,-80,-80,,,,,,,,,,,
